In [4]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [5]:
obj = pd.Series([1,4,-3,5])

In [7]:
obj.array, obj.index

(<PandasArray>
 [1, 4, -3, 5]
 Length: 4, dtype: int64,
 RangeIndex(start=0, stop=4, step=1))

In [12]:
obj2 = pd.Series([4,6,-2,5], index=['d', 'a', 'c',' b'])
obj2, obj2.index, obj2.array

(d     4
 a     6
 c    -2
  b    5
 dtype: int64,
 Index(['d', 'a', 'c', ' b'], dtype='object'),
 <PandasArray>
 [4, 6, -2, 5]
 Length: 4, dtype: int64)

In [14]:
obj2["a"]
obj2["b"] = 80

In [15]:
obj2

d      4
a      6
c     -2
 b     5
b     80
dtype: int64

In [16]:
obj2[["a", "b", "c"]]

a     6
b    80
c    -2
dtype: int64

In [18]:
obj2[obj2 > 4]

a      6
 b     5
b     80
dtype: int64

In [19]:
np.exp(obj2)

d     5.459815e+01
a     4.034288e+02
c     1.353353e-01
 b    1.484132e+02
b     5.540622e+34
dtype: float64

In [20]:
"b" in obj2, "z" in obj2

(True, False)

In [21]:
sdata = { 'ktm': 1829, 'btl': 12423, 'brt': 192083, 'pokh': 90 }
obj3 = pd.Series(sdata)
obj3

ktm       1829
btl      12423
brt     192083
pokh        90
dtype: int64

In [25]:
obj3.to_dict()
obj3

ktm       1829
btl      12423
brt     192083
pokh        90
dtype: int64

In [26]:
states = ['pokh', 'ktm', 'btl', 'brt']
obj4 = pd.Series(sdata, index=states)

In [27]:
obj4

pokh        90
ktm       1829
btl      12423
brt     192083
dtype: int64

In [28]:
pd.isna(obj4)

pokh    False
ktm     False
btl     False
brt     False
dtype: bool

In [29]:
pd.notna(obj4)

pokh    True
ktm     True
btl     True
brt     True
dtype: bool

In [31]:
obj4.isna(), obj4.notna()

(pokh    False
 ktm     False
 btl     False
 brt     False
 dtype: bool,
 pokh    True
 ktm     True
 btl     True
 brt     True
 dtype: bool)

In [32]:
obj3

ktm       1829
btl      12423
brt     192083
pokh        90
dtype: int64

In [33]:
obj3 + obj4 #data is aligned by index label`

brt     384166
btl      24846
ktm       3658
pokh       180
dtype: int64

In [34]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
pokh        90
ktm       1829
btl      12423
brt     192083
Name: population, dtype: int64

In [35]:
obj

0    1
1    4
2   -3
3    5
dtype: int64

In [38]:
obj.index = ['bob', 'cheems', 'doge', 'sriganesh']
obj.index.name = 'First Name'

In [39]:
obj

First Name
bob          1
cheems       4
doge        -3
sriganesh    5
dtype: int64

In [40]:
# dataframes
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
 "year": [2000, 2001, 2002, 2001, 2002, 2003],
 "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [43]:
frame, frame.head(), frame.tail()

(    state  year  pop
 0    Ohio  2000  1.5
 1    Ohio  2001  1.7
 2    Ohio  2002  3.6
 3  Nevada  2001  2.4
 4  Nevada  2002  2.9
 5  Nevada  2003  3.2,
     state  year  pop
 0    Ohio  2000  1.5
 1    Ohio  2001  1.7
 2    Ohio  2002  3.6
 3  Nevada  2001  2.4
 4  Nevada  2002  2.9,
     state  year  pop
 1    Ohio  2001  1.7
 2    Ohio  2002  3.6
 3  Nevada  2001  2.4
 4  Nevada  2002  2.9
 5  Nevada  2003  3.2)

In [44]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [45]:
frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "debt"])
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [46]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [47]:
frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [50]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [51]:
frame2.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [52]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [53]:
frame2["debt"] = 16.8

In [54]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.8
1  2001    Ohio  1.7  16.8
2  2002    Ohio  3.6  16.8
3  2001  Nevada  2.4  16.8
4  2002  Nevada  2.9  16.8
5  2003  Nevada  3.2  16.8

In [57]:
frame2['debt'] = np.arange(6.)

In [58]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [59]:
val = pd.Series([-1.2, -1.5, -1.7], index=["two", "four", "five"])

In [60]:
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [61]:
frame2.debt

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
5    5.0
Name: debt, dtype: float64

In [63]:
frame2['debt'] = val

In [64]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [65]:
frame2["eastern"] = frame2["state"] == "Ohio"
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6   NaN     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9   NaN    False
5  2003  Nevada  3.2   NaN    False

In [66]:
del frame2["eastern"]

In [67]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [68]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
"Nevada": {2001: 2.4, 2002: 2.9}}

In [69]:
frame3 = pd.DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [70]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [71]:
pd.DataFrame(populations, index=[2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [73]:
pdata = {"Ohio": frame3["Ohio"][:-1],
 "Nevada": frame3["Nevada"][:2]}

In [74]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4